{"intents": [
        {"tag": "greeting",
         "family": "infos_generales",
         "patterns": ["Hi",
                        "How are you", 
                        "Is anyone there?",
                        "Hello",
                        "Good day",
                        "Hey",
                        "What's up",
                        "Good evening",
                        "Good afternoon",
                        "Good morning",
                        "Greetings! ",
                        "Good day, mate!",
                        "Hey bot",
                        "Yo!",
                        "G'day",
                        "Good day",
                        "Sup?",
                        "Hey, buddy!",
                        "Hello there!",
                        "Well, hello!",
                        "Hey, pal!",
                        "Howdy!",
                        "Hey, buddy!",
                        "Salutations!"
        ],
         "responses": ["Hello, thanks for visiting", "Hi there, how can I help?", 
                        "Good to see you again",
                        "Hey! How's it going?",
                        "Hello! Ready to assist you!",
                        "Good day! What brings you here today?",
                        "Hey, nice to see you! What can I do for you?",
                        "Hi there! Need any assistance?",
                        "Hello! How may I assist you today?",
                        "Hello, friend! What brings you here today?",
                        "Hi! Welcome back. What can I do for you?",
                        "Hey! I'm here and ready to assist. What do you need help with?",
                        "Hi there! Need assistance with anything?",
                        "Hello! How can I be of service to you today?",
                        "Hi! It's great to see you. What can I help you with?",
                        "Hey! How can I make your experience better today?",
                        "Hello! I'm here to assist you. What can I do for you?",
                        "Hi! Let's chat. What do you need help with?",
                        "Hey there! How can I make your day a little brighter?",
                        "Hello! Ready to assist. What can I do for you today?",
                        "Hi! Need assistance with anything specific?",
                        "Hey! I'm here to lend a hand. What can I assist you with?",
                        "Hello! How can I help you today?",
                        "Hi! I'm at your service. What do you need help with?",
                        "Hello! Ready to chat. What can I do for you?",
                        "Hiya! I'm all ears. What's on your mind?",
                        "Hey! Good to see you. How can I make your day better?"],
         "context_set": ""
        },
        {"tag": "goodbye",
        "family": "infos_generales",
         "patterns": ["Bye", "See you later", "Goodbye",   
                        "See you",
                        "Take care",
                        "Have a good one",
                        "Catch you later",
                        "Adios",
                        "Later",
                        "Farewell",
                        "Gotta go",
                        "Until next time",
                        "So long",
                        "Bye for now",
                        "Talk to you later",
                        "I'm off",
                        "Till we meet again",
                        "Bye-bye",
                        "Take it easy",
                        "Take care, friend",
                        "Time for me to leave",
                        "I'm out",
                        "Time to go",
                        "Gotta run"],
         "responses": ["See you later, thanks for visiting", "Have a nice day", "Bye! Come back again soon.",  "Goodbye! Have a great day!",
         "Bye! Take care!",
         "See you later! Don't hesitate to come back!",
         "Take care! Goodbye for now!",
         "Adios! Until next time!",
         "Farewell! Come back anytime!",
         "Gotta go? Alright, take care!",
         "Bye for now! Stay safe!",
         "Talk to you later! Have a good one!",
         "So long! Take care of yourself!",
         "See you! Have a wonderful day!",
         "Until next time! Goodbye!",
         "Bye-bye! Take care of yourself!",
         "Take it easy! See you soon!",
         "Take it easy! See you later!",
         "Keep in touch! Goodbye!",
         "Peace out! Have a great day!",
         "Later, gator! Take care!",
         "I'm heading out! Goodbye!",
         "Toodles! Take care!",
         "Take care, friend! See you soon!"]
        },
        {"tag": "thanks",
         "family": "infos_generales",
         "patterns": ["Thanks", "Thank you", "That's helpful",
         "Thanks a lot",
         "Appreciate it",
         "Much obliged",
         "Thank you so much",
         "Cheers",
         "Many thanks",
         "Big thanks",
         "Thanks again",
         "You're a lifesaver",
         "I owe you one",
         "Grateful",
         "Thanks a million",
         "You're the best",
         "You rock",
         "I appreciate your help",
         "That's really helpful",
         "You're awesome",
         "Thanks a ton",
         "Thank you very much",
         "Thanks for everything",
         "Thanks a bunch",
         "Thank you for your assistance",
         "You're amazing",
         "I'm grateful for your help"],
         "responses": ["Happy to help!", "Any time!", "My pleasure",
         "You're welcome! Happy to help!",
         "No problem at all! Glad I could assist!",
         "You're welcome! Anytime!",
         "You're welcome! It's my pleasure!",
         "Glad to help! Let me know if you need anything else!",
         "You're welcome! Don't hesitate to ask if you need more assistance!",
         "You're welcome! Cheers to you too!",
         "You're welcome! Always happy to assist!",
         "You're welcome! Big thanks for reaching out!",
         "You're welcome! Thanks for the appreciation!",
         "You're welcome! I'm here whenever you need me!",
         "You're welcome! Happy to be of service!",
         "You're welcome! Thanks for the kind words!",
         "You're welcome! It was my pleasure to assist!",
         "You're welcome! Thanks for being awesome!",
         "You're welcome! Anytime you need help, just let me know!",
         "You're welcome! Thanks for reaching out!",
         "You're welcome! I'm glad I could help!",
         "You're welcome! Thank you for your gratitude!",
         "You're welcome! Thanks for being a great user!"]
        },
        
        {"tag": "help",
         "family": "infos_generales",
         "patterns":  ["How you could help me?", "What help you provide?", "How you can be helpful?",
                        "In what ways can you assist me?",
                        "What kind of support do you offer?",
                        "How can you lend a hand?",
                        "What assistance do you offer?",
                        "How can you aid me?",
                        "What services do you provide?",
                        "How can you be of assistance?",
                        "What support do you offer?",
                        "How can you assist me with this?",
                        "What resources do you have available to help?",
                        "How do you provide assistance?",
                        "What solutions can you offer?",
                        "How can you contribute to solving this problem?",
                        "What aid can you provide in this situation?",
                        "How do you offer guidance?",
                        "What expertise do you bring to the table?",
                        "How can you support me in achieving my goals?"
                        ],
         "responses": ["We offer a diverse array of medical assistance, ranging from virtual consultations with healthcare professionals to personalized guidance on symptom management. Additionally, we furnish comprehensive information regarding available treatments. For example, if you're seeking information about a specific condition like trauma, you can ask questions like 'What are the symptoms of trauma?' or 'How can I cope with trauma?' Is there anything specific you'd like to learn about or discuss today?",

                        "Our platform ensures round-the-clock access to trustworthy medical insights, complemented by an extensive repository of educational materials covering a spectrum of health conditions. We also extend aid in connecting users with local specialists suited to their needs. For instance, if you're interested in understanding more about diabetes management, you might ask, 'What are the dietary recommendations for managing diabetes?' or 'How can I find a diabetes specialist in my area?' Is there anything specific you'd like to learn about or discuss today?",
                        
                        "We're dedicated to supporting you throughout your health journey. Our services extend beyond mere medical advice, encompassing emotional support, counsel on cultivating healthy lifestyles, and recommendations for accessing community resources. For example, if you're curious about mental health resources, you could inquire about coping strategies for anxiety or depression. Is there anything specific you'd like to learn about or discuss today?",
                        
                        "Within our suite of services, you'll find tools designed for monitoring symptoms, reminders for medication schedules, and direct access to a team of qualified medical experts who are equipped to address your inquiries and alleviate your concerns. For instance, if you're managing chronic pain, you might ask about pain management techniques or alternative therapies. Is there anything specific you'd like to learn about or discuss today?",
                        
                        "We understand the complexities of managing chronic illnesses, which is why our support extends to stress management initiatives, tailored nutritional guidance, and assistance in adhering to prescribed treatments. Our goal is to empower you in effectively managing your health. For example, if you're interested in learning about managing a specific chronic condition like arthritis, you could inquire about exercises for joint pain relief or dietary recommendations for arthritis sufferers. Is there anything specific you'd like to learn about or discuss today?"]
        },
        {"tag": "about",
         "family": "infos_generales",
         "patterns":  [],
         "responses": ["I can guide you through Adverse management problems, order tracking, person to be contacted and Department related queries","I can provide support related to following problems technical query,management related query,order related query,tracking related query,procurement query,outsourcing problem,manufacturing delay,"]
        },
        {"tag": "traduction",
         "family": "traduction",
         "patterns": ["How can we say this paragraph in English: What are the symptoms of Diaper rash ?",
                        "Could you translate this Chinese phrase into English: How to save Scrofula ?",
                        "What would be the appropriate English translation for this passage:How to save Scrofula ?",
                        "How would we express this in English: What are the treatments for Diabetes ?",
                        "Can you render this Chinese idea into English: What is (are) AIDS-Related Lymphoma ?",
                        "What's the English equivalent for this Chinese term: What is (are) AIDS-Related Lymphoma ?",
                        "Could you convert this Chinese text into English: What are the treatments for Diabetes ?",
                        "How would you interpret this Chinese sentence in English: What are the symptoms of Diaper rash ?",
                        "Could you render this Chinese phrase into English: What affective Seasonal causes disorder ?",
                        "What's the most accurate English translation for this Chinese expression: What are the treatments for Diabetes ?",
                        "How can we say this paragraph in English: What are the treatments for Diabetes ?",
                        "Could you translate this Chinese phrase into English: What affective Seasonal causes disorder ?",
                        "What would be the appropriate English translation for this passage: What are the symptoms of Diaper rash ?",
                        "How would we express this in English: who is at risk for astatine Preeclampsia -?",
                        "Can you render this Chinese idea into English: What affective Seasonal causes disorder ?",
                        "What's the English equivalent for this Chinese term: What are the symptoms of Adult Acute Lymphoblastic Leukemia ?",
                        "Could you convert this Chinese text into English:What are the treatments for Diabetes ?",
                        "How would you interpret this Chinese sentence in English: who is at risk for astatine Preeclampsia -?",
                        "Could you render this Chinese phrase into English: What Tremor causes ?",
                        "What's the most accurate English translation for this Chinese expression: What Tremor causes ?"
                        ],
         "responses": []
        },
        {"tag": "medical",
         "family": "medical",
         "patterns": [  "What are the symptoms of Adult Acute Lymphoblastic Leukemia ?",
                        "What are the treatments for Adult Acute Myeloid Leukemia ?",
                        "Do you have information about Laparoscopic gastric banding",
                        "What is (are) AIDS-Related Lymphoma ?",
                        "What is (are) Life after weight-loss surgery ?",
                        "What are the symptoms of Adult Central Nervous System Tumors ?",
                        "What causes Childhood Astrocytomas ?",
                        "who is at risk for astatine Preeclampsia -?",
                        "Who is at represent risk for solidus - risk factors? ?",
                        "Who is at risk for Tennis elbow surgery?",
                        "What Schizoid causes personality disorder ?",
                        "What affective Seasonal causes disorder ?",
                        "What Tremor causes ?",
                        "How to prevent Developmental disorders of the female reproductive ?",
                        "How to save Scrofula ?",
                        "What other information should I know about Ciprofloxacin ?",
                        "How should Carmustine Implant be used and what is the dosage ?",
                        "Do you have information about Giving an insulin injection",
                        "What are the treatments for Diabetes ?",
                        "What are the symptoms of Diaper rash ?",
                        "Do you have information about Ear examination",
                        "What is (are) Labyrinthitis - aftercare ?"],
         "responses": []
        }
   ]
}

